In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'Names': ['Jane', 'Peter', 'Ken', 'Rob'], 'Age': [30,45,12,25]}

d

{'Names': ['Jane', 'Peter', 'Ken', 'Rob'], 'Age': [30, 45, 12, 25]}

In [3]:
df = pd.DataFrame(d)

df

   Names  Age
0   Jane   30
1  Peter   45
2    Ken   12
3    Rob   25

In [4]:
df = pd.DataFrame(d, index = ["first", "second", "third", "forth"])

df

        Names  Age
first    Jane   30
second  Peter   45
third     Ken   12
forth     Rob   25

In [5]:
df['Names']

first      Jane
second    Peter
third       Ken
forth       Rob
Name: Names, dtype: object

In [6]:
df['Age']

first     30
second    45
third     12
forth     25
Name: Age, dtype: int64

In [7]:
df.loc['first']

Names    Jane
Age        30
Name: first, dtype: object

In [8]:
df

        Names  Age
first    Jane   30
second  Peter   45
third     Ken   12
forth     Rob   25

In [10]:
df.reset_index()

    index  Names  Age
0   first   Jane   30
1  second  Peter   45
2   third    Ken   12
3   forth    Rob   25

In [ ]:
# filtering of data
df['last'] ==